DataProcessors/Renault_ПолучениеПисемДляТрафика.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>Renault_ПолучениеПисемДляТрафика</Name>
			<Comment>Получение писем для трафика</Comment>
		</Properties>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/КонтактнаяИнформация.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>КонтактнаяИнформация</Name>
			<Comment>Контактная информация контрагентов, контактных лиц, организаций и сотрудников</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗначениеПоУмолчанию</Name>
					<Comment>Признак значения по умолчанию</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Произвольный комментарий</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле1</Name>
					<Comment>Вспомогательное поле: "Код страны" или "Индекс"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>6</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле2</Name>
					<Comment>Вспомогательное поле: "Код города" или "Регион"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле3</Name>
					<Comment>Вспомогательное поле: "Номер телефона" или "Район"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле4</Name>
					<Comment>Вспомогательное поле: "Внутренний (или добавочный)  номер" или "Город"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле5</Name>
					<Comment>Вспомогательное поле: "Населенный пункт"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле6</Name>
					<Comment>Вспомогательное поле: "Улица"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле7</Name>
					<Comment>Вспомогательное поле: "Дом"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле8</Name>
					<Comment>Вспомогательное поле: "Корпус"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле9</Name>
					<Comment>Вспомогательное поле: "Квартира"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Представление</Name>
					<Comment>Строковое представление контактной информации</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле10</Name>
					<Comment>Вспомогательное поле: "Подъезд"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле11</Name>
					<Comment>Вспомогательное поле: "Этаж"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле12</Name>
					<Comment>Вспомогательное поле: "Код двери/домофон"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтанцияМетро</Name>
					<Comment>Станция метро</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтанцииМетро</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГородскойРайон</Name>
					<Comment>Городской район проживания</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Районы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>CRM_ПолеХраненияНомера</Name>
					<Comment>Индексирование тел. номера для поиска</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>31</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипДома</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДомов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипКорпуса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКорпусов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипКвартиры</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКвартир</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>КраткоеПредставление</Name>
					<Comment>Краткое представление</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Comment>Объект-владелец контактной информации</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияГК</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.CRM_ПотенциальныеКонтрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Тип</Name>
					<Comment>Тип контактной информации</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Вид</Name>
					<Comment>Вид контактной информации</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/Renault_ТрафикПисьма.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Renault_ТрафикПисьма</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаПоступления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТемаПисьма</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекстПисьма</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПочтаКлиента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТрафикПросмотрен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УчетнаяЗапись</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Renault_КонтактЦентр_УчетныеЗаписиЭлектроннойПочты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПросмотра</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПредставлениеКлиента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РезультатОбработки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Renault_РезультатОбработки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФорматТекста</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ФорматТекста</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИдентификаторПисьма</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдТрафика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/Renault_Трафик.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Renault_Трафик</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Представление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПервичныйИнтерес</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ПервичныйИнтерес</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьПервичныйИнтерес</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Модели</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьИсточникИнформации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиИнформации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИсточникИнформации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ИсточникиИнформации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипАктивности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DMS_ТипыАктивностиТрафика</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Город</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Закрытый</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РабочийЛист</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Renault_РабочийЛист</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипТрафика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ТипТрафика</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Обработан</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Отдел</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_Отделы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Администратор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.CRM_ПотенциальныеКонтрагенты</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПервичныйПовторный</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CRM_ПервичныйПовторный</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДилерскийЦентр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ДилерскиеЦентры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СтатусыСообщений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>СтатусыСообщений</Name>
			<Comment>Статусы  сообщений (например, электронного письма)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Входящее</Name>
					<Comment>Входящее сообщение</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Исходящее</Name>
					<Comment>Исходящее сообщение</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отправленное</Name>
					<Comment>Отправленное сообщение</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сохраненное</Name>
					<Comment>Сохраненное сообщение</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

DataProcessors/Renault_ПолучениеПисемДляТрафика/Ext/ObjectModule.bsl
// Возвращает исправленную строку
Функция ИсправитьСтроку(ИсходнаяСтрока)
    Если ИсходнаяСтрока = "" Тогда
        Возврат "";
	КонецЕсли;
	Результат = ИсходнаяСтрока;
    Пока Истина Цикл
        Позиция = НайтиНедопустимыеСимволыXML(Результат);        
        Если Позиция = 0 Тогда
            Прервать;
        КонецЕсли;
        Результат = Сред(Результат,1, Позиция-1)+Сред(Результат, Позиция+1); 
    КонецЦикла;
    
    Результат = СтрЗаменить(Результат, Символ(13) + Символ(10), Символы.ПС);
    Результат = СтрЗаменить(Результат, Символ(182), Символы.ПС);
    Возврат Результат;
КонецФункции

Функция ПолучитьПочтуИзСтроки(Клиент)
	Позиция1 = Найти(Клиент,"<");
	Позиция2 = Найти(Клиент,">");
	ИскомаяПочта = Сред(Клиент, Позиция1+1, Позиция2-Позиция1-1);
    Возврат ?(Найти(ИскомаяПочта,"@")>0, ИскомаяПочта, 0);
КонецФункции

// Заполнение таблицы письмами почтового клиента
Функция ЗаполнениеТаблицаОбработки(Таблица) Экспорт
	Таблица.Очистить();
	LastLoadDate = ?(Константы.Renault_Mail4Traffic_LastReadDate.Получить()=Дата("00010101"), Дата("20010101"),Константы.Renault_Mail4Traffic_LastReadDate.Получить());
		
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЭлектронноеПисьмо.ИдентификаторПисьма,
	               |	ЭлектронноеПисьмо.УчетнаяЗапись КАК УчетнаяЗапись,
	               |	ЭлектронноеПисьмо.УчетнаяЗапись.Renault_ДилерскийЦентр КАК ДилерскийЦентр,
	               |	ЭлектронноеПисьмо.УчетнаяЗапись.Renault_ИсточникИнформации КАК ИсточникИнформации,
	               |	ЭлектронноеПисьмо.Тема КАК ТемаПисьма,
	               |	ЭлектронноеПисьмо.ТекстПисьма,
	               |	ЭлектронноеПисьмо.ДатаПолучения,
	               |	ЭлектронноеПисьмо.ОтправительПредставление КАК Отправитель
	               |ИЗ
	               |	Документ.ЭлектронноеПисьмо КАК ЭлектронноеПисьмо
				   |ГДЕ
				   |	ЭлектронноеПисьмо.УчетнаяЗапись.Renault_НеИспользоватьТрафик = ЛОЖЬ
				   |	И ЭлектронноеПисьмо.ПометкаУдаления = ЛОЖЬ
				   |	И ЭлектронноеПисьмо.ДатаПолучения > &ДатаЧтения
				   |	И ЭлектронноеПисьмо.СтатусПисьма = ЗНАЧЕНИЕ(Перечисление.СтатусыСообщений.Входящее)";
	Запрос.УстановитьПараметр("ДатаЧтения",LastLoadDate);			   
	ТаблицаПисем = Запрос.Выполнить().Выгрузить();
	Для Каждого Письмо из ТаблицаПисем Цикл 
			ТекСтрока = Таблица.Добавить();
			ТекСтрока.УчетнаяЗапись = Письмо.УчетнаяЗапись;
			ТекСтрока.ИДПисьма = Письмо.ИдентификаторПисьма;
			ТекСтрока.ТемаПисьма = Письмо.ТемаПисьма;
			ТекСтрока.ТекстПисьма = ИсправитьСтроку(Письмо.ТекстПисьма);		
			ТекСтрока.ДилерскийЦентр = Письмо.ДилерскийЦентр;
			ТекСтрока.ИсточникИнформации = Письмо.ИсточникИнформации;
			ТекСтрока.ДатаПоступления = Письмо.ДатаПолучения;
			Если ТипЗнч(Письмо.Отправитель) = Тип("Строка") Тогда
				ТекСтрока.Отправитель = Сред(Письмо.Отправитель, Найти(Письмо.Отправитель, ":")+1);
				ТекСтрока.ПочтаКлиента = ПолучитьПочтуИзСтроки(Письмо.Отправитель);
			Иначе
				ТекСтрока.Отправитель = Сред(Письмо.Отправитель.Адрес, Найти(Письмо.Отправитель.Адрес, ":")+1);
				ТекСтрока.ПочтаКлиента = Письмо.Отправитель.Адрес;
			КонецЕсли;
	КонецЦикла;	
	Возврат Истина;
КонецФункции

Функция НайтиСоздатьКлиента(Наименование, емэйл, телефон="")
	СоздаватьКлиента = Истина;
	Если ЗначениеЗаполнено(емэйл) Тогда

		Запрос = Новый Запрос("ВЫБРАТЬ
		                      |	КонтактнаяИнформация.Объект
		                      |ИЗ
		                      |	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
		                      |ГДЕ
		                      |	КонтактнаяИнформация.Представление ПОДОБНО &Представление
		                      |	И КонтактнаяИнформация.Тип = &Тип
		                      |	И КонтактнаяИнформация.ЗначениеПоУмолчанию = ИСТИНА");
			
		Запрос.УстановитьПараметр("Тип",Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
		Запрос.УстановитьПараметр("Представление",емэйл);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			СоздаватьКлиента = Ложь;
			Возврат Выборка.Объект;
		КонецЕсли;
	КонецЕсли;
	Если СоздаватьКлиента и ЗначениеЗаполнено(Телефон) Тогда
		Запрос = Новый Запрос("ВЫБРАТЬ
		                      |	КонтактнаяИнформация.Объект
		                      |ИЗ
		                      |	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
		                      |ГДЕ
		                      |	КонтактнаяИнформация.Представление ПОДОБНО &Представление
		                      |	И КонтактнаяИнформация.Тип = &Тип
		                      |	И КонтактнаяИнформация.ЗначениеПоУмолчанию = ИСТИНА");
			
		Запрос.УстановитьПараметр("Тип",Перечисления.ТипыКонтактнойИнформации.Телефон);
		Запрос.УстановитьПараметр("Представление",Телефон);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			СоздаватьКлиента = Ложь;
			Возврат Выборка.Объект;
		КонецЕсли;

	КонецЕсли;

	Если СоздаватьКлиента Тогда
		Нов = Справочники.CRM_ПотенциальныеКонтрагенты.СоздатьЭлемент();
		Нов.Наименование = Наименование;
		Нов.НаименованиеПолное = Наименование;
		Нов.СогласиеНаОбработкуПерсональныхДанных = перечисления.ВариантыОтветов.Да;
		Нов.ВидОтношений = Справочники.ВидыВзаимоотношений.КонтактноеЛицо;
		Нов.ВидКонтрагента = Перечисления.ВидыКонтрагентов.Покупатель;
		Нов.Записать();
		Если  ЗначениеЗаполнено(емэйл) Тогда
			Renault_УправлениеКонтактнойИнформацией.ЗаписатьОсновнойEmailКлиента(емэйл,Нов.Ссылка);
		КонецЕсли;
		Если ЗначениеЗаполнено(телефон) Тогда
			Renault_УправлениеКонтактнойИнформацией.ЗаписатьОсновнойТелефонКлиента(телефон,нов.Ссылка);
		КонецЕсли;
		Возврат Нов.Ссылка;
	КонецЕсли; 
КонецФункции

Функция ТрафикПисьмаСуществует(Ид)
	Запрос = Новый запрос("ВЫБРАТЬ
	                      |	Renault_ТрафикПисьма.ИдентификаторПисьма
	                      |ИЗ
	                      |	РегистрСведений.Renault_ТрафикПисьма КАК Renault_ТрафикПисьма
	                      |ГДЕ
	                      |	Renault_ТрафикПисьма.ИдентификаторПисьма = &ид");
	Запрос.УстановитьПараметр("ид",Ид);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;	
КонецФункции

// Сохранение указанных писем
Процедура ОбработкаИмпортВыполнить(Таблица) Экспорт
	Для Каждого ТекСтрока Из Таблица Цикл
		Если НЕ ТекСтрока.Пометка Тогда
			Продолжить;
		КонецЕсли;
		Если Не ТрафикПисьмаСуществует(ТекСтрока.ИДПисьма) Тогда
			Трафик = СоздатьТрафикПисьма(ТекСтрока);
			Мен = РегистрыСведений.Renault_ТрафикПисьма.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(Мен,ТекСтрока); 
			Мен.ИдТрафика = Трафик.Идентификатор;
			Мен.ИдентификаторПисьма = ТекСтрока.ИДПисьма;
			Мен.ТрафикПросмотрен = Ложь;
			Попытка
				Мен.Записать();
			Исключение
			КонецПопытки;			
		КонецЕсли;      	
	КонецЦикла;
	Константы.Renault_Mail4Traffic_LastReadDate.Установить(ТекущаяДата());
КонецПроцедуры

Функция СоздатьТрафикПисьма(Письмо)
	ЗаписьТрафик = РегистрыСведений.Renault_Трафик.СоздатьМенеджерЗаписи();
	//ЗаполнитьЗначенияСвойств(ЗаписьТрафик,Описание);
	ЗаписьТрафик.ДилерскийЦентр = Письмо.ДилерскийЦентр;
	Идентификатор = Новый УникальныйИдентификатор();
	ЗаписьТрафик.Идентификатор = Идентификатор; 
	Если обЗначениеНеЗаполнено(Письмо.ДатаПоступления) Тогда ЗаписьТрафик.Период = ТекущаяДата();
	Иначе ЗаписьТрафик.Период = Письмо.ДатаПоступления;
	КонецЕсли;
	ЗаписьТрафик.ТипТрафика = Справочники.CRM_ТипТрафика.Email;
	ЗаписьТрафик.ИсточникИнформации = Письмо.ИсточникИнформации;
	ЗаписьТрафик.Клиент = НайтиСоздатьКлиента(Письмо.Отправитель,);                              
//	ЗаписьТрафик.Комментарий = "Тип лида"""+Описание.TYPE_LEAD +""", категория лида """+ Описание.SOUS_TYPE_LEAD +Символы.ПС+ """,Сообщение клиента - """+Описание.INT_COMMENTAIRE+""""+Символы.ПС;
//	ЗаписьТрафик.ПервичныйИнтерес = НайтиСоздатьПервичныйИнтерес(Описание.VEH_MDL,Описание.VEH_VIN);
	ЗаписьТрафик.Обработан = Ложь;
	ЗаписьТрафик.ПервичныйПовторный = Перечисления.CRM_ПервичныйПовторный.Первичный;
	ЗаписьТрафик.Записать();
	
	Возврат ЗаписьТрафик;
КонецФункции;
